mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/spi.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013, 2014 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <string.h>

#include "py/runtime.h"
#include "py/mphal.h"
#include "extmod/machine_spi.h"
#include "irq.h"
#include "pin.h"
#include "bufhelper.h"
#include "spi.h"

#include "driverlib/ssi.h"
#include "inc/hw_ssi.h"
#include "inc/hw_memmap.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "inc/hw_udma.h"

/// \moduleref pyb
/// \class SPI - a master-driven serial protocol
///
/// SPI is a serial protocol that is driven by a master.  At the physical level
/// there are 3 lines: SCK, MOSI, MISO.
///
/// See usage model of I2C; SPI is very similar.  Main difference is
/// parameters to init the SPI bus:
///
///     from pyb import SPI
///     spi = SPI(1, SPI.MASTER, baudrate=600000, polarity=1, phase=0, crc=0x7)
///
/// Only required parameter is mode, SPI.MASTER or SPI.SLAVE.  Polarity can be
/// 0 or 1, and is the level the idle clock line sits at.  Phase can be 0 or 1
/// to sample data on the first or second clock edge respectively.  Crc can be
/// None for no CRC, or a polynomial specifier.
///
/// Additional method for SPI:
///
///     data = spi.send_recv(b'1234')        # send 4 bytes and receive 4 bytes
///     buf = bytearray(4)
///     spi.send_recv(b'1234', buf)          # send 4 bytes and receive 4 into buf
///     spi.send_recv(buf, buf)              # send/recv 4 bytes from/to buf

// Possible DMA configurations for SPI busses:
// SPI1_TX: DMA2_Stream3.CHANNEL_3 or DMA2_Stream5.CHANNEL_3
// SPI1_RX: DMA2_Stream0.CHANNEL_3 or DMA2_Stream2.CHANNEL_3
// SPI2_TX: DMA1_Stream4.CHANNEL_0
// SPI2_RX: DMA1_Stream3.CHANNEL_0
// SPI3_TX: DMA1_Stream5.CHANNEL_0 or DMA1_Stream7.CHANNEL_0
// SPI3_RX: DMA1_Stream0.CHANNEL_0 or DMA1_Stream2.CHANNEL_0
// SPI4_TX: DMA2_Stream4.CHANNEL_5 or DMA2_Stream1.CHANNEL_4
// SPI4_RX: DMA2_Stream3.CHANNEL_5 or DMA2_Stream0.CHANNEL_4
// SPI5_TX: DMA2_Stream4.CHANNEL_2 or DMA2_Stream6.CHANNEL_7
// SPI5_RX: DMA2_Stream3.CHANNEL_2 or DMA2_Stream5.CHANNEL_7
// SPI6_TX: DMA2_Stream5.CHANNEL_1
// SPI6_RX: DMA2_Stream6.CHANNEL_1

// #if defined(MICROPY_HW_SPI1_SCK)
// SPI_HandleTypeDef SPIHandle1 = {.Instance = NULL};
// #endif
// #if defined(MICROPY_HW_SPI2_SCK)
// SPI_HandleTypeDef SPIHandle2 = {.Instance = NULL};
// #endif
// #if defined(MICROPY_HW_SPI3_SCK)
// SPI_HandleTypeDef SPIHandle3 = {.Instance = NULL};
// #endif
// #if defined(MICROPY_HW_SPI4_SCK)
// SPI_HandleTypeDef SPIHandle4 = {.Instance = NULL};
// #endif
// #if defined(MICROPY_HW_SPI5_SCK)
// SPI_HandleTypeDef SPIHandle5 = {.Instance = NULL};
// #endif
// #if defined(MICROPY_HW_SPI6_SCK)
// SPI_HandleTypeDef SPIHandle6 = {.Instance = NULL};
// #endif

void spi_init0(void) {
    // Initialise the SPI handles.
    // The structs live on the BSS so all other fields will be zero after a reset.
    // #if defined(MICROPY_HW_SPI1_SCK)
    // SPIHandle1.Instance = SPI1;
    // #endif
    // #if defined(MICROPY_HW_SPI2_SCK)
    // SPIHandle2.Instance = SPI2;
    // #endif
    // #if defined(MICROPY_HW_SPI3_SCK)
    // SPIHandle3.Instance = SPI3;
    // #endif
    // #if defined(MICROPY_HW_SPI4_SCK)
    // SPIHandle4.Instance = SPI4;
    // #endif
    // #if defined(MICROPY_HW_SPI5_SCK)
    // SPIHandle5.Instance = SPI5;
    // #endif
    // #if defined(MICROPY_HW_SPI6_SCK)
    // SPIHandle6.Instance = SPI6;
    // #endif
}

STATIC int spi_find(mp_obj_t id) {
    if (MP_OBJ_IS_STR(id)) {
        // given a string id
        const char *port = mp_obj_str_get_str(id);
        if (0) {
        #ifdef MICROPY_HW_SPI1_NAME
        } else if (strcmp(port, MICROPY_HW_SPI0_NAME) == 0) {
            return 0;
        #endif
        #ifdef MICROPY_HW_SPI1_NAME
        } else if (strcmp(port, MICROPY_HW_SPI1_NAME) == 0) {
            return 1;
        #endif
        #ifdef MICROPY_HW_SPI2_NAME
        } else if (strcmp(port, MICROPY_HW_SPI2_NAME) == 0) {
            return 2;
        #endif
        #ifdef MICROPY_HW_SPI3_NAME
        } else if (strcmp(port, MICROPY_HW_SPI3_NAME) == 0) {
            return 3;
        #endif
        }
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError,
            "SPI(%s) doesn't exist", port));
    } else {
        // given an integer id
        int spi_id = mp_obj_get_int(id);
        if (spi_id >= 0 && spi_id <= MP_ARRAY_SIZE(MP_STATE_PORT(machine_spi_obj_all))
            && MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1] != NULL) {
            return spi_id;
        }
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError,
            "SPI(%d) doesn't exist", spi_id));
    }
}

// sets the parameters in the SPI_InitTypeDef struct
// if an argument is -1 then the corresponding parameter is not changed
// STATIC void spi_set_params(mp_obj_t *spi_obj, uint8_t prescale, int32_t baudrate,
//     int32_t polarity, int32_t phase, int32_t bits, int32_t firstbit) {
//     machine_hard_spi_obj_t *self = spi_obj;

//     if (prescale != 0xff || baudrate != -1) {
//         if (prescale == 0xff) {
//             // prescaler not given, so select one that yields at most the requested baudrate
//             mp_uint_t spi_clock = MAP_SysCtlClockGet();
//             prescale = (spi_clock / baudrate);
//         }
//         prescale &= 0xFE;
//     }

//     if (polarity != -1) {
//         init->CLKPolarity = polarity == 0 ? SPI_POLARITY_LOW : SPI_POLARITY_HIGH;
//     }

