mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/spi.c
//     if (phase != -1) {
//         init->CLKPhase = phase == 0 ? SPI_PHASE_1EDGE : SPI_PHASE_2EDGE;
//     }

//     if (bits != -1) {
//         init->DataSize = (bits == 16) ? SPI_DATASIZE_16BIT : SPI_DATASIZE_8BIT;
//     }

//     if (firstbit != -1) {
//         init->FirstBit = firstbit;
//     }
// }

// TODO allow to take a list of pins to use
void spi_init(const machine_hard_spi_obj_t *self_in) {
    machine_hard_spi_obj_t *self = self_in;
    const pin_obj_t *pins[4] = { NULL, NULL, NULL, NULL };

    if (0) {
    #if defined(MICROPY_HW_SPI0_SCK)
    } else if (self->spi_id == PYB_SPI_0) {
        self->spi_base = SSI0_BASE;
        self->periph = SYSCTL_PERIPH_SSI0;
        self->regs = (periph_spi_t*)SSI0_BASE;
        self->irqn = INT_SSI0;
        pins[0] = MICROPY_HW_SPI0_SCK;
        #if defined(MICROPY_HW_SPI0_MISO)
        pins[1] = MICROPY_HW_SPI0_MISO;
        #endif
        #if defined(MICROPY_HW_SPI0_MOSI)
        pins[2] = MICROPY_HW_SPI0_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI0_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI0_FSS;
        }
        #endif
    #endif
    #if defined(MICROPY_HW_SPI1_SCK)
    } else if (self->spi_id == PYB_SPI_1) {
        self->spi_base = SSI1_BASE;
        self->periph = SYSCTL_PERIPH_SSI1;
        self->regs = (periph_spi_t*)SSI1_BASE;
        self->irqn = INT_SSI1;
        pins[0] = MICROPY_HW_SPI1_SCK;
        #if defined(MICROPY_HW_SPI1_MISO)
        pins[1] = MICROPY_HW_SPI1_MISO;
        #endif
        #if defined(MICROPY_HW_SPI1_MOSI)
        pins[2] = MICROPY_HW_SPI1_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI1_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI1_FSS;
        }
        #endif
    #endif
    #if defined(MICROPY_HW_SPI2_SCK)
    } else if (self->spi_id == PYB_SPI_2) {
        self->spi_base = SSI2_BASE;
        self->periph = SYSCTL_PERIPH_SSI2;
        self->regs = (periph_spi_t*)SSI2_BASE;
        self->irqn = INT_SSI2;
        pins[0] = MICROPY_HW_SPI2_SCK;
        #if defined(MICROPY_HW_SPI2_MISO)
        pins[1] = MICROPY_HW_SPI2_MISO;
        #endif
        #if defined(MICROPY_HW_SPI2_MOSI)
        pins[2] = MICROPY_HW_SPI2_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI2_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI2_FSS;
        }
        #endif
    #endif
    #if defined(MICROPY_HW_SPI3_SCK)
    } else if (self->spi_id == PYB_SPI_3) {
        self->spi_base = SSI3_BASE;
        self->periph = SYSCTL_PERIPH_SSI3;
        self->regs = (periph_spi_t*)SSI3_BASE;
        self->irqn = INT_SSI3;
        pins[0] = MICROPY_HW_SPI3_SCK;
        #if defined(MICROPY_HW_SPI3_MISO)
        pins[1] = MICROPY_HW_SPI3_MISO;
        #endif
        #if defined(MICROPY_HW_SPI3_MOSI)
        pins[2] = MICROPY_HW_SPI3_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI3_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI3_FSS;
        }
        #endif
    #endif
    } else {
        // SPI does not exist for this board (shouldn't get here, should be checked by caller)
        return;
    }

    // init the GPIO lines
    for (uint i = 0; i < (self->soft_fss ? 3 : 4); i++) {
        if (pins[i] == NULL) {
            continue;
        }
        mp_hal_pin_config_alt(pins[i], PIN_FN_SSI, self->spi_id);
        // idle_high_polarity
        if(i==0 && (self->protocol & 0x1) ) MAP_GPIOPadConfigSet(pins[i]->gpio, pins[i]->pin_mask, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);
    }

    // init the SPI device

    SysCtlPeripheralEnable(self->periph);
    while(!SysCtlPeripheralReady(self->periph));
    IntDisable(self->irqn);
    SSIDisable(self->spi_base);
    
    SSIClockSourceSet(self->spi_base, SSI_CLOCK_SYSTEM);
    SSIConfigSetExpClk(self->spi_base, MAP_SysCtlClockGet(), self->protocol, self->mode, self->baudrate, self->bits);
    SSIDMADisable(self->spi_base, SSI_DMA_TX | SSI_DMA_RX);
    SSIDMAEnable(self->spi_base, self->dma_enabled);

    SSIEnable(self->spi_base);
}

void spi_deinit(const machine_hard_spi_obj_t *self) {
    SSIDisable(self->spi_base);
    SysCtlPeripheralDisable(self->periph);
}

STATIC HAL_StatusTypeDef spi_wait_dma_finished(const spi_t *spi, uint32_t timeout) {
    uint32_t start = HAL_GetTick();
    volatile HAL_SPI_StateTypeDef *state = &spi->spi->State;
    for (;;) {
        // Do an atomic check of the state; WFI will exit even if IRQs are disabled
        uint32_t irq_state = disable_irq();
        if (*state == HAL_SPI_STATE_READY) {
            enable_irq(irq_state);
            return HAL_OK;
        }
        __WFI();
        enable_irq(irq_state);
        if (HAL_GetTick() - start >= timeout) {
            return HAL_TIMEOUT;
        }
    }
    return HAL_OK;
}

// A transfer of "len" bytes should take len*8*1000/baudrate milliseconds.
// To simplify the calculation we assume the baudrate is never less than 8kHz
// and use that value for the baudrate in the formula, plus a small constant.
#define SPI_TRANSFER_TIMEOUT(len) ((len) + 100)

STATIC void spi_transfer(const machine_hard_spi_obj_t *self, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout) {

    if (dest == NULL) {
        // send only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_Transmit(self->spi, (uint8_t*)src, len, timeout);
        } else {
            DMA_HandleTypeDef tx_dma;
            dma_init(&tx_dma, self->tx_dma_descr, self->spi);
            self->spi->hdmatx = &tx_dma;
            self->spi->hdmarx = NULL;
            MP_HAL_CLEAN_DCACHE(src, len);
            status = HAL_SPI_Transmit_DMA(self->spi, (uint8_t*)src, len);
            if (status == HAL_OK) {
                status = spi_wait_dma_finished(self, timeout);
            }
            dma_deinit(self->tx_dma_descr);
        }
    } else if (src == NULL) {
        // receive only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_Receive(self->spi, dest, len, timeout);
        } else {
            DMA_HandleTypeDef tx_dma, rx_dma;
            if (self->spi->Init.Mode == SPI_MODE_MASTER) {
                // in master mode the HAL actually does a TransmitReceive call
                dma_init(&tx_dma, self->tx_dma_descr, self->spi);
                self->spi->hdmatx = &tx_dma;
            } else {
                self->spi->hdmatx = NULL;
            }
            dma_init(&rx_dma, self->rx_dma_descr, self->spi);
            self->spi->hdmarx = &rx_dma;
            MP_HAL_CLEANINVALIDATE_DCACHE(dest, len);
            status = HAL_SPI_Receive_DMA(self->spi, dest, len);
            if (status == HAL_OK) {
                status = spi_wait_dma_finished(self, timeout);
            }
            if (self->spi->hdmatx != NULL) {
                dma_deinit(self->tx_dma_descr);
            }
            dma_deinit(self->rx_dma_descr);
        }
    } else {
        // send and receive
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_TransmitReceive(self->spi, (uint8_t*)src, dest, len, timeout);
        } else {
            DMA_HandleTypeDef tx_dma, rx_dma;
            dma_init(&tx_dma, self->tx_dma_descr, self->spi);
            self->spi->hdmatx = &tx_dma;
            dma_init(&rx_dma, self->rx_dma_descr, self->spi);
            self->spi->hdmarx = &rx_dma;
            MP_HAL_CLEAN_DCACHE(src, len);
            MP_HAL_CLEANINVALIDATE_DCACHE(dest, len);
            status = HAL_SPI_TransmitReceive_DMA(self->spi, (uint8_t*)src, dest, len);
            if (status == HAL_OK) {
                status = spi_wait_dma_finished(self, timeout);
            }
            dma_deinit(self->tx_dma_descr);
            dma_deinit(self->rx_dma_descr);
        }
    }

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }
}

