mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/spi.c
const mp_obj_type_t pyb_spi_type = {
    { &mp_type_type },
    .name = MP_QSTR_SPI,
    .print = pyb_spi_print,
    .make_new = pyb_spi_make_new,
    .protocol = &pyb_spi_p,
    .locals_dict = (mp_obj_dict_t*)&pyb_spi_locals_dict,
};

/******************************************************************************/
// Implementation of hard SPI for machine module

typedef struct _machine_hard_spi_obj_t {
    mp_obj_base_t base;
    uint32_t spi_base;
    uint32_t periph;
    periph_spi_t* regs;
    uint32_t irqn;
    uint8_t mode : 1;
    uint32_t baudrate;
    uint8_t bits;
    // uint8_t polarity : 1;
    // uint8_t phase : 1;
    uint32_t protocol;
    spi_id_t spi_id : 3;
    bool is_enabled : 1;
    bool soft_fss : 1; // Frame signal generated by hardware, or manually
    uint8_t dma_enabled : 3;
} machine_hard_spi_obj_t;

STATIC void machine_hard_spi_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*)self_in;
    spi_print(print, self->spi, false);
}

mp_obj_t machine_hard_spi_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
    

    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // find SPI port
    spi_id_t spi_id = spi_find(all_args[0]);

    // create dynamic peripheral object
    machine_hard_spi_obj_t *self;

    // get SPI object
    if (MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1] == NULL) {
        // create new SSI object
        self = m_new0(machine_hard_spi_obj_t, 1);
        self->base.type = &machine_hard_spi_type;
        self->spi_id = spi_id;
        MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1] = self;
    } else {
        // reference existing SSI object
        self = MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1];
    }

    if (n_args > 1 || n_kw > 0) {
        // start the peripheral
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, all_args + n_args);
        machine_hard_spi_init_helper(self, n_args - 1, all_args + 1, &kw_args);
    }

    return MP_OBJ_FROM_PTR(self);
}

STATIC mp_obj_t machine_hard_spi_init_helper(machine_hard_spi_obj_t* self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode, ARG_id, ARG_baudrate,/* ARG_prescaler, ARG_polarity, ARG_phase,*/ ARG_bits, ARG_fss, ARG_protocol, ARG_dma, ARG_firstbit, ARG_sck, ARG_mosi, ARG_miso };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = SSI_MODE_MASTER} }, // Default as master
        { MP_QSTR_id,       MP_ARG_OBJ, {.u_obj = MP_OBJ_NEW_SMALL_INT(-1)} },
        { MP_QSTR_baudrate, MP_ARG_INT, {.u_int = 500000} },
        //{ MP_QSTR_prescaler, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0xFF} },       // max prescaler
        // { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} }, // idle low          
        // { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} }, // first clock edge
        //{ MP_QSTR_dir,      MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = SSI_CR1_DIR} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 8} }, 
        { MP_QSTR_fss,   MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false}}, // chip select mode (software or hardware)
        { MP_QSTR_protocol,      MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = SSI_FRF_MOTO_MODE_0} }, // SSI in SPI mode
        { MP_QSTR_dma,      MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_int = 0}}, // no dma
        //{ MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = SPI_FIRSTBIT_MSB} },
        //{ MP_QSTR_ti,       MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        //{ MP_QSTR_crc,      MP_ARG_KW_ONLY | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
        //{ MP_QSTR_sck,      MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        //{ MP_QSTR_mosi,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        //{ MP_QSTR_miso,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    

    // here we would check the sck/mosi/miso pins and configure them, but it's not implemented
    if (args[ARG_sck].u_obj != MP_OBJ_NULL
        || args[ARG_mosi].u_obj != MP_OBJ_NULL
        || args[ARG_miso].u_obj != MP_OBJ_NULL) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError,"explicit choice of sck/mosi/miso is not implemented"));
    }

    // set the SPI configuration values
    if(args[ARG_mode].u_int > 2) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "Mode accepts only MASTER or SLAVE"));
    }
    self->mode = args[ARG_mode].u_int;

    if(args[ARG_bits].u_int >= 16 || args[ARG_bits].u_int <= 4) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "invalid word length, only values 4..16 are available"));
    }
    self->bits = args[ARG_bits].u_int;

    // if(args[ARG_prescaler].u_int & 0xFFFFFF00) {
    //     nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "prescaler only 2-254!"));
    // }
    // uint8_t prescale = args[ARG_prescaler].u_int;

    if(self->mode) {
        if(args[ARG_baudrate].u_int >= 25000000) {
            nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "baudrate too high, max 25 Mbaud as master"));
        }
    } else {
        if(args[ARG_baudrate].u_int >= 6666666) {
            nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "baudrate too high, max 6.66 mBaud as slave"));
        }
    }
    self->baudrate = args[ARG_baudrate].u_int;

    if(!(args[ARG_protocol].u_int == SSI_FRF_MOTO_MODE_0 || args[ARG_protocol].u_int == SSI_FRF_MOTO_MODE_1  ||
         args[ARG_protocol].u_int == SSI_FRF_MOTO_MODE_2 || args[ARG_protocol].u_int == SSI_FRF_MOTO_MODE_3  ||
         args[ARG_protocol].u_int == SSI_FRF_TI || args[ARG_protocol].u_int == SSI_FRF_NMW)) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "protocol not supported, please use SPI0..3, TI or MICROWIRE!"));
    }
    self->protocol = args[ARG_fss].u_int;

    if(args[ARG_fss].u_int != 0 || args[ARG_fss].u_int != 1) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "fss only accepts CS_HARD(0) or CS_SOFT(1)"));
    }
    // Automatic or Manually assert chipselect? Only applicable in SPI mode
    if(self->protocol == SSI_CR0_FRF_MOTO) {
        self->soft_fss = args[ARG_fss].u_bool;
    } else {
        self->soft_fss = false;
    }

    if(!(args[ARG_dma].u_int & 0x03)) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "dma accepts only DMA_NONE(0), DMA_RX(1), DMA_TX(2) or DMA_BOTH(3)"));
    }
    self->dma_enabled = args[ARG_dma].u_int;
    
    // init the SPI bus
    spi_init(self);

    return mp_const_none;
}

STATIC void machine_hard_spi_init(mp_obj_base_t *self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    machine_hard_spi_init_helper(self_in, n_args, pos_args, kw_args);
}

STATIC void machine_hard_spi_deinit(mp_obj_base_t *self_in) {
    machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*)self_in;
    spi_deinit(self->spi);
}

STATIC void machine_hard_spi_transfer(mp_obj_base_t *self_in, size_t len, const uint8_t *src, uint8_t *dest) {
    machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*)self_in;
    spi_transfer(self->spi, len, src, dest, SPI_TRANSFER_TIMEOUT(len));
}

STATIC const mp_rom_map_elem_t machine_hard_spi_locals_dict_table[] = {
    // instance methods
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_hard_spi_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_hard_spi_deinit_obj) },

    { MP_ROM_QSTR(MP_QSTR_read), MP_ROM_PTR(&mp_machine_spi_read_obj) },
    { MP_ROM_QSTR(MP_QSTR_readinto), MP_ROM_PTR(&mp_machine_spi_readinto_obj) },
    { MP_ROM_QSTR(MP_QSTR_write), MP_ROM_PTR(&mp_machine_spi_write_obj) },
    { MP_ROM_QSTR(MP_QSTR_write_readinto), MP_ROM_PTR(&mp_machine_spi_write_readinto_obj) },

    // legacy methods
    { MP_ROM_QSTR(MP_QSTR_send), MP_ROM_PTR(&machine_hard_spi_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_recv), MP_ROM_PTR(&machine_hard_spi_recv_obj) },
    { MP_ROM_QSTR(MP_QSTR_send_recv), MP_ROM_PTR(&machine_hard_spi_send_recv_obj) },

    // class constants
    /// \constant MASTER - for initialising the bus to master mode
    /// \constant SLAVE - for initialising the bus to slave mode
    /// \constant MSB - set the first bit to MSB
    /// \constant LSB - set the first bit to LSB
    { MP_ROM_QSTR(MP_QSTR_MASTER), MP_ROM_INT(SSI_MODE_MASTER) },
    { MP_ROM_QSTR(MP_QSTR_SLAVE),  MP_ROM_INT(SSI_MODE_SLAVE) },
    { MP_ROM_QSTR(MP_QSTR_SLAVE_OD),  MP_ROM_INT(SSI_MODE_SLAVE_OD) },
    // { MP_ROM_QSTR(MP_QSTR_MSB),    MP_ROM_INT(SPI_FIRSTBIT_MSB) },
    // { MP_ROM_QSTR(MP_QSTR_LSB),    MP_ROM_INT(SPI_FIRSTBIT_LSB) },
    { MP_ROM_QSTR(MP_QSTR_SPI0),    MP_ROM_INT(SSI_FRF_MOTO_MODE_0)},
    { MP_ROM_QSTR(MP_QSTR_SPI1),    MP_ROM_INT(SSI_FRF_MOTO_MODE_1)},
    { MP_ROM_QSTR(MP_QSTR_SPI2),    MP_ROM_INT(SSI_FRF_MOTO_MODE_2)},
    { MP_ROM_QSTR(MP_QSTR_SPI3),    MP_ROM_INT(SSI_FRF_MOTO_MODE_3)},
    { MP_ROM_QSTR(MP_QSTR_TI),      MP_ROM_INT(SSI_FRF_TI)},
    { MP_ROM_QSTR(MP_QSTR_MICROWIRE),    MP_ROM_INT(SSI_FRF_NMW)},
    { MP_ROM_QSTR(MP_QSTR_FIRST_EDGE),    MP_ROM_INT(0)},
    { MP_ROM_QSTR(MP_QSTR_SECOND_EDGE),    MP_ROM_INT(1)},
    { MP_ROM_QSTR(MP_QSTR_IDLE_LOW),    MP_ROM_INT(0)},
    { MP_ROM_QSTR(MP_QSTR_IDLE_HIGH),    MP_ROM_INT(1)},
    { MP_ROM_QSTR(MP_QSTR_FSS_SOFT),    MP_ROM_INT(true)},
    { MP_ROM_QSTR(MP_QSTR_FSS_HARD),    MP_ROM_INT(false)},
    { MP_ROM_QSTR(MP_QSTR_DMA_NONE),    MP_ROM_INT(0)},
    { MP_ROM_QSTR(MP_QSTR_DMA_RX),    MP_ROM_INT(SSI_DMA_RX)},
    { MP_ROM_QSTR(MP_QSTR_DMA_TX),    MP_ROM_INT(SSI_DMA_TX)},
    { MP_ROM_QSTR(MP_QSTR_DMA_BOTH),    MP_ROM_INT(SSI_DMA_TX | SSI_DMA_RX)},

    /* TODO
    { MP_ROM_QSTR(MP_QSTR_DIRECTION_2LINES             ((uint32_t)0x00000000)
    { MP_ROM_QSTR(MP_QSTR_DIRECTION_2LINES_RXONLY      SPI_CR1_RXONLY
    { MP_ROM_QSTR(MP_QSTR_DIRECTION_1LINE              SPI_CR1_BIDIMODE
    { MP_ROM_QSTR(MP_QSTR_NSS_SOFT                    SPI_CR1_SSM
    { MP_ROM_QSTR(MP_QSTR_NSS_HARD_INPUT              ((uint32_t)0x00000000)
    { MP_ROM_QSTR(MP_QSTR_NSS_HARD_OUTPUT             ((uint32_t)0x00040000)
    */
};

STATIC MP_DEFINE_CONST_DICT(machine_hard_spi_locals_dict, machine_hard_spi_locals_dict_table);

STATIC const mp_machine_spi_p_t machine_hard_spi_p = {
    .init = machine_hard_spi_init,
    .deinit = machine_hard_spi_deinit,
    .transfer = machine_hard_spi_transfer,
};

const mp_obj_type_t machine_hard_spi_type = {
    { &mp_type_type },
    .name = MP_QSTR_SPI,
    .print = machine_hard_spi_print,
    .make_new = mp_machine_spi_make_new, // delegate to master constructor
    .protocol = &machine_hard_spi_p,
    .locals_dict = (mp_obj_t)&machine_hard_spi_locals_dict,
};

const spi_t *spi_from_mp_obj(mp_obj_t o) {
    if (MP_OBJ_IS_TYPE(o, &pyb_spi_type)) {
        pyb_spi_obj_t *self = o;
        return self->spi;
    } else if (MP_OBJ_IS_TYPE(o, &machine_hard_spi_type)) {
        machine_hard_spi_obj_t *self = o;;
        return self->spi;
    } else {
        mp_raise_TypeError("expecting an SPI object");
    }
}
